[
  {
    "tanya": "Apa yang dimaksud dengan aliterasi dalam sastra?",
    "jawab": "Aliterasi adalah pengulangan bunyi konsonan pada awal kata atau suku kata yang berdekatan untuk menciptakan efek estetis dan ritmis dalam teks.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan asonansi dalam sastra?",
    "jawab": "Asonansi adalah pengulangan bunyi vokal dalam kata-kata yang berdekatan untuk memperkuat suasana atau melodi teks.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan metafora dalam sastra?",
    "jawab": "Metafora adalah gaya bahasa yang membandingkan dua hal secara langsung tanpa menggunakan kata penghubung ‘seperti’ atau ‘bagai’, untuk menciptakan makna kiasan.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan simile dalam sastra?",
    "jawab": "Simile adalah gaya bahasa yang membandingkan dua hal dengan menggunakan kata penghubung seperti ‘seperti’, ‘bagai’, atau ‘laksana’ untuk menegaskan kemiripan.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan hiperbola dalam sastra?",
    "jawab": "Hiperbola adalah gaya bahasa yang melebih-lebihkan sesuatu secara ekstrem untuk menekankan atau memberi efek dramatis.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan litotes dalam sastra?",
    "jawab": "Litotes adalah gaya bahasa yang menyatakan sesuatu dengan cara merendah atau mengurangi kelebihan untuk mencapai efek halus atau sindiran terselubung.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan ironi dalam sastra?",
    "jawab": "Ironi adalah gaya bahasa atau situasi di mana makna sebenarnya berlawanan dengan apa yang diungkapkan secara eksplisit atau diharapkan pembaca.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan satir dalam sastra?",
    "jawab": "Satir adalah penggunaan humor, sindiran, atau ejekan untuk mengekspos dan mengkritik kebodohan, keburukan, atau perilaku sosial tertentu.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan parodi dalam sastra?",
    "jawab": "Parodi adalah peniruan gaya, tema, atau karya sastra tertentu dengan tujuan humor atau kritik.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan alegori dalam sastra?",
    "jawab": "Alegori adalah narasi atau deskripsi bertingkat di mana tokoh, peristiwa, dan setting mewakili ide-ide abstrak atau moral.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan simbolisme dalam sastra?",
    "jawab": "Simbolisme adalah penggunaan simbol—objek, kata, atau gambar—untuk mewakili ide, konsep, atau kualitas yang lebih dalam.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan sinestesia dalam sastra?",
    "jawab": "Sinestesia adalah penggabungan dua atau lebih indera dalam deskripsi, misalnya ‘suara manis’ atau ‘warna berdenting’ untuk menciptakan pengalaman puitis.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan metafiksi dalam sastra?",
    "jawab": "Metafiksi adalah teknik naratif yang menyadari dirinya sebagai karya fiksi, sering kali mengomentari proses penulisan atau keterbatasan fiksi itu sendiri.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan intertekstualitas dalam sastra?",
    "jawab": "Intertekstualitas adalah hubungan dan penafsiran sebuah teks melalui referensi atau alusi pada teks lain.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan monolog dalam sastra?",
    "jawab": "Monolog adalah dialog panjang yang diucapkan seorang tokoh dalam drama atau narasi yang mencerminkan pemikiran dan perasaannya secara mendalam.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan dialog dalam sastra?",
    "jawab": "Dialog adalah percakapan antara dua atau lebih tokoh dalam karya sastra untuk mengembangkan alur, karakter, dan konflik.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan alur maju dalam sastra?",
    "jawab": "Alur maju (prolepsis) adalah struktur narasi yang mengikuti urutan kronologis dari peristiwa-peristiwa tanpa lompatan waktu ke masa lalu.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan alur mundur dalam sastra?",
    "jawab": "Alur mundur (analepsis) adalah teknik bercerita yang melompat ke peristiwa masa lalu untuk menjelaskan latar belakang atau motivasi karakter.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan klimaks dalam sastra?",
    "jawab": "Klimaks adalah puncak ketegangan atau konflik dalam cerita yang menentukan arah penyelesaian konflik tersebut.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan antiklimaks dalam sastra?",
    "jawab": "Antiklimaks adalah penurunan dramatis setelah puncak ketegangan, sering kali menimbulkan efek mengejutkan atau lucu.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan protagonis dalam sastra?",
    "jawab": "Protagonis adalah tokoh utama dalam cerita yang menghadapi konflik dan mengalami perkembangan karakter.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan antagonis dalam sastra?",
    "jawab": "Antagonis adalah tokoh atau kekuatan yang menjadi oposisi atau penghalang bagi protagonis.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan tokoh majmuk dalam sastra?",
    "jawab": "Tokoh majmuk adalah karakter yang kompleks, memiliki kelebihan dan kekurangan, serta mengalami perkembangan sepanjang cerita.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan narator dalam sastra?",
    "jawab": "Narator adalah suara pencerita yang menyampaikan kisah, bisa berupa peserta (orang pertama) atau pengamat (orang ketiga).",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan sudut pandang orang pertama dalam sastra?",
    "jawab": "Sudut pandang orang pertama adalah narasi yang diceritakan langsung oleh tokoh utama menggunakan kata ganti ‘aku’ atau ‘saya’.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan sudut pandang orang ketiga dalam sastra?",
    "jawab": "Sudut pandang orang ketiga adalah narasi yang disampaikan oleh narator eksternal menggunakan kata ganti ‘dia’ atau nama tokoh.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan tema dalam sastra?",
    "jawab": "Tema adalah gagasan pokok atau ide sentral yang diungkapkan melalui pengembangan plot, karakter, dan setting.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan setting dalam sastra?",
    "jawab": "Setting adalah latar waktu, tempat, dan situasi di mana peristiwa cerita berlangsung.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan motif dalam sastra?",
    "jawab": "Motif adalah unsur, ide, atau simbol yang berulang dan berkontribusi pada penguatan tema cerita.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan gaya bahasa dalam sastra?",
    "jawab": "Gaya bahasa adalah cara khas pengarang menggunakan pilihan kata (diksi) dan struktur kalimat untuk menyampaikan nuansa dan karakter tulisan.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan diksi dalam sastra?",
    "jawab": "Diksi adalah pemilihan dan penggunaan kata-kata yang tepat dan efektif untuk membangun suasana dan makna dalam teks.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan eufemisme dalam sastra?",
    "jawab": "Eufemisme adalah penggunaan kata-kata yang lebih halus atau sopan untuk menggantikan istilah yang dianggap kasar atau tabu.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan dekompresi dalam sastra?",
    "jawab": "Dekompresi adalah teknik naratif yang memperlambat laju cerita dengan menampilkan detail dan deskripsi mendalam.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan kompresi dalam sastra?",
    "jawab": "Kompresi adalah teknik naratif yang merangkum atau mempercepat alur cerita dengan mengurangi detail deskriptif.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan deduksi dalam sastra?",
    "jawab": "Deduksi adalah penalaran logis yang dimulai dari premis umum menuju kesimpulan khusus dalam argumen atau dialog karakter.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan induksi dalam sastra?",
    "jawab": "Induksi adalah penalaran logis yang memulai dari pengamatan atau fakta khusus menuju rumusan umum.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan kritik sastra dalam sastra?",
    "jawab": "Kritik sastra adalah analisis dan penilaian karya sastra berdasarkan teori, konteks, dan kualitas estetika.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan hermeneutika dalam sastra?",
    "jawab": "Hermeneutika adalah teori dan metode penafsiran teks, terutama teks sastra dan filosofis.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan strukturalisme dalam sastra?",
    "jawab": "Strukturalisme adalah pendekatan teori sastra yang menganalisis struktur dasar teks dan relasi antarunsurnya.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan dekonstruksi dalam sastra?",
    "jawab": "Dekonstruksi adalah pendekatan kritis yang membongkar dan mempertanyakan makna tetap teks, menyoroti ambiguitas dan kontradiksi.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan modernisme dalam sastra?",
    "jawab": "Modernisme adalah gerakan sastra awal abad ke-20 yang menolak tradisi klasik dan menekankan eksperimentasi bentuk dan bahasa.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan postmodernisme dalam sastra?",
    "jawab": "Postmodernisme adalah gerakan sastra pasca-Perang Dunia II yang merayakan fragmentasi, ironi, dan heterogenitas makna.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan romantisme dalam sastra?",
    "jawab": "Romantisme adalah gerakan sastra akhir abad ke-18 hingga awal abad ke-19 yang menekankan emosi, imajinasi, dan alam.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan realisme dalam sastra?",
    "jawab": "Realisme adalah gerakan sastra abad ke-19 yang berusaha menggambarkan kehidupan sehari-hari secara jujur dan objektif.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan naturalisme dalam sastra?",
    "jawab": "Naturalisme adalah cabang realisme yang menekankan determinisme lingkungan dan naluri biologis dalam perilaku karakter.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan surealisme dalam sastra?",
    "jawab": "Surealisme adalah gerakan avant-garde abad ke-20 yang memadukan realitas dan mimpi untuk mengeksplorasi alam bawah sadar.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan soneta dalam sastra?",
    "jawab": "Soneta adalah puisi 14 baris yang terbagi menjadi dua kuartet dan dua terzet, dengan pola rima dan ritme tertentu.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan balada dalam sastra?",
    "jawab": "Balada adalah puisi naratif yang menceritakan kisah dramatis atau romantis dengan bait berulang dan irama yang khas.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan epik dalam sastra?",
    "jawab": "Epik adalah puisi panjang yang menceritakan petualangan pahlawan dan peristiwa besar dalam latar sejarah atau mitologis.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan prosa dalam sastra?",
    "jawab": "Prosa adalah bentuk penulisan bebas tanpa struktur ritmis atau bait seperti puisi, mencakup narasi, esai, dan cerita pendek.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan puisi dalam sastra?",
    "jawab": "Puisi adalah bentuk ekspresi sastra yang menekankan bunyi, ritme, dan citraan melalui baris-baris berstruktur.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan drama dalam sastra?",
    "jawab": "Drama adalah genre sastra yang ditulis untuk dipentaskan, mengandung dialog dan petunjuk panggung.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan cerpen dalam sastra?",
    "jawab": "Cerpen adalah cerita pendek yang fokus pada satu konflik utama dan dibatasi oleh ruang dan waktu yang ringkas.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan novel dalam sastra?",
    "jawab": "Novel adalah cerita panjang dengan pengembangan plot, karakter, dan tema yang kompleks.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan novella dalam sastra?",
    "jawab": "Novella adalah bentuk narasi yang panjangnya antara cerpen dan novel, dengan alur yang lebih fokus.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan prolog dalam sastra?",
    "jawab": "Prolog adalah bagian pendahuluan yang memberikan konteks atau latar belakang sebelum cerita utama dimulai.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan epilog dalam sastra?",
    "jawab": "Epilog adalah bagian penutup yang menyimpulkan atau memberikan informasi tambahan setelah akhir cerita.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan parateks dalam sastra?",
    "jawab": "Parateks adalah elemen teks pendukung seperti judul, sampul, catatan kaki, dan kata pengantar yang menyertai karya utama.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan metanarasi dalam sastra?",
    "jawab": "Metanarasi adalah narasi besar atau cerita induk yang mendasari narasi-narasi lain dalam suatu budaya atau teks.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan footnote dalam sastra?",
    "jawab": "Footnote adalah catatan kaki yang memberikan penjelasan, referensi, atau komentar tambahan dalam teks.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan metonimia dalam sastra?",
    "jawab": "Metonimia adalah gaya bahasa yang menggantikan satu kata dengan kata lain yang memiliki hubungan kontigu atau kausal.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan synekdoke dalam sastra?",
    "jawab": "Synekdoke adalah gaya bahasa di mana bagian mewakili keseluruhan atau sebaliknya, misalnya ‘kaki’ untuk ‘manusia’.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan oxymoron dalam sastra?",
    "jawab": "Oxymoron adalah penyatuan dua kata yang bermakna berlawanan untuk menciptakan paradoks atau efek dramatis.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan enjambment dalam sastra?",
    "jawab": "Enjambment adalah kelanjutan baris puisi tanpa jeda sintaksis pada akhir baris, sehingga makna mengalir ke baris berikutnya.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan asindeton dalam sastra?",
    "jawab": "Asindeton adalah penghilangan kata penghubung untuk menciptakan ritme cepat dan menekankan deretan kata atau frasa.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan polisindeton dalam sastra?",
    "jawab": "Polisindeton adalah penggunaan berulang kata penghubung untuk memberi kesan lambat atau menegaskan setiap elemen.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan anadiplosis dalam sastra?",
    "jawab": "Anadiplosis adalah pengulangan kata atau frasa pada akhir satu klausa dan awal klausa berikutnya untuk efek kohesi.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan epanalepsis dalam sastra?",
    "jawab": "Epanalepsis adalah pengulangan kata atau frasa di awal dan akhir klausa untuk menekankan gagasan tertentu.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan paradoks dalam sastra?",
    "jawab": "Paradoks adalah pernyataan atau situasi yang tampak kontradiktif namun mengandung kebenaran tersembunyi.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan klise dalam sastra?",
    "jawab": "Klise adalah ungkapan, tema, atau elemen cerita yang sudah terlalu sering digunakan sehingga kehilangan kekuatan aslinya.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan kolokasi dalam sastra?",
    "jawab": "Kolokasi adalah kecenderungan kata-kata tertentu untuk muncul bersamaan secara alami dalam sebuah bahasa.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan kodifikasi dalam sastra?",
    "jawab": "Kodifikasi adalah proses pembakuan bahasa atau aturan sastra dalam bentuk tertulis.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan fonetik dalam sastra?",
    "jawab": "Fonetik adalah studi tentang bunyi bahasa dan cara pengucapannya, penting dalam analisis puisi dan metrum.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan fonologi dalam sastra?",
    "jawab": "Fonologi adalah studi sistem bunyi dalam bahasa dan pola-pola yang muncul, berguna untuk memahami irama puisi.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan semiotika dalam sastra?",
    "jawab": "Semiotika adalah ilmu tanda dan simbol, serta cara makna dibangun dan diinterpretasikan dalam teks sastra.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan epos dalam sastra?",
    "jawab": "Epos adalah narasi panjang berima yang menceritakan kisah kepahlawanan atau legenda dalam tradisi lisan.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan pantun dalam sastra?",
    "jawab": "Pantun adalah bentuk puisi tradisional Melayu-Indonesia dengan pola a-b-a-b, terdiri dari sampiran dan isi.",
    "kategori": "Sastra"
  },
  {
    "tanya": "Apa yang dimaksud dengan gurindam dalam sastra?",
    "jawab": "Gurindam adalah puisi Melayu dua baris dengan sekali kalimat, mengandung nasihat atau pedoman hidup.",
    "kategori": "Sastra"
  }
]